mutations/06-mousedown-drops-pill-hit-test.patch
Test: TapTests/FixItTests/testABlockUsesAnUndeclaredDriver
diff --git i/desktop/Tap/Editor/EditorTextView.swift w/desktop/Tap/Editor/EditorTextView.swift
index 058ab59..c9f4ad3 100644
--- i/desktop/Tap/Editor/EditorTextView.swift
+++ w/desktop/Tap/Editor/EditorTextView.swift
@@ -604,10 +604,6 @@ final class EditorTextView: NSTextView {
     override func mouseDown(with event: NSEvent) {
         let point = convert(event.locationInWindow, from: nil)
         // A Control-click on the pill is a context menu click, as anywhere on the header.
-        if !event.modifierFlags.contains(.control), let index = boxIndex(forHeaderAt: point), let pill = fixItRect(forBoxAt: index), pill.contains(point) {
-            editorDelegate?.editor(self, applyFixItForBoxAt: index)
-            return
-        }
         // A Control-click is a context menu click, and a
         // Shift-click extends the selection; neither starts a header drag.
         guard !event.modifierFlags.contains(.control), !event.modifierFlags.contains(.shift),
