mutations/07-fail-drop-takedownwindows.patch
Test: TapTests/PresentingFailureTests/testATalkEndsWhenTapPresentKeepsDying
diff --git i/desktop/Tap/Presenting/PresentationController.swift w/desktop/Tap/Presenting/PresentationController.swift
index 462c962..2b43b88 100644
--- i/desktop/Tap/Presenting/PresentationController.swift
+++ w/desktop/Tap/Presenting/PresentationController.swift
@@ -1042,7 +1042,6 @@ final class PresentationController {
     /// last slide the audience saw, whatever made it fail.
     private func fail(_ message: String) {
         failedAfterShowing = windowsWereShown
-        takeDownWindows()
         if let session { AppEnvironment.shared.stopAndRetain(session) }
         session = nil
         client = nil
