mutations/14-ready-never-returns-the-preview-to-its-slide.patch
Test: TapTests/PreviewTests/testThePreviewReturnsToTheCursorsSlideAfterAReloadTheAppDidNotStart
diff --git i/desktop/Tap/Documents/DeckSessionController.swift w/desktop/Tap/Documents/DeckSessionController.swift
index 756beb8..9318258 100644
--- i/desktop/Tap/Documents/DeckSessionController.swift
+++ w/desktop/Tap/Documents/DeckSessionController.swift
@@ -309,7 +309,6 @@ final class DeckSessionController: NSObject, EditorTextViewDelegate {
         previewViewController.onLog = { [weak self] line in self?.session.log.append(line, source: .app) }
         previewViewController.onReady = { [weak self] payload in
             self?.previewDidRender(payload)
-            self?.returnThePreviewToItsSlide(after: payload)
         }
         if let documentUndoManager = document.undoManager {
             undoObserver = NotificationCenter.default.addObserver(forName: .NSUndoManagerDidUndoChange, object: documentUndoManager, queue: nil) { [weak self] _ in
