mutations/20-starting-keeps-talk-failed-bar.patch
Test: TapTests/PresentingFailureTests/testATalkThatCannotStartShowsABar
diff --git i/desktop/Tap/Windows/DeckWindowController.swift w/desktop/Tap/Windows/DeckWindowController.swift
index 8838492..e40f9a2 100644
--- i/desktop/Tap/Windows/DeckWindowController.swift
+++ w/desktop/Tap/Windows/DeckWindowController.swift
@@ -84,7 +84,6 @@ final class DeckWindowController: NSWindowController, NSWindowDelegate, NSToolba
             case .failed: self?.talkEnded(failed: true)
             case .starting:
                 self?.sessionController.editorViewController.hideBar(.recordingKept)
-                self?.sessionController.editorViewController.hideBar(.talkFailed)
                 self?.sessionController.editorViewController.hideBar(.talkNotStarted)
             case .presenting, .stopping: break
             }
