mutations/24-controlchanged-drops-guard-r.patch
Test: TapTests/DeckTabTests/testDeckSettingsLiveInTheInspector
diff --git i/desktop/Tap/Preview/DeckFormViewController.swift w/desktop/Tap/Preview/DeckFormViewController.swift
index 4ea877d..1e3ee7f 100644
--- i/desktop/Tap/Preview/DeckFormViewController.swift
+++ w/desktop/Tap/Preview/DeckFormViewController.swift
@@ -316,7 +316,6 @@ final class DeckFormViewController: NSViewController, NSTextFieldDelegate {
                 raw = Frontmatter.scalar(forString: typed)
             }
         }
-        guard raw != frontmatter.value(at: path) else { return }
         guard let replacement = frontmatter.setting(path: path, to: raw) else {
             NSSound.beep()
             refresh()
