mutations/26-rebuild-skips-object-sections-r.patch
Test: TapTests/DeckTabTests/testTheObjectGroupsHaveTheirFields
diff --git i/desktop/Tap/Preview/DeckFormViewController.swift w/desktop/Tap/Preview/DeckFormViewController.swift
index 4ea877d..aecced7 100644
--- i/desktop/Tap/Preview/DeckFormViewController.swift
+++ w/desktop/Tap/Preview/DeckFormViewController.swift
@@ -207,9 +207,6 @@ final class DeckFormViewController: NSViewController, NSTextFieldDelegate {
         if !scalars.isEmpty {
             addSection(title: "Deck", rows: scalars.map { row(for: $0, path: [$0.name]) })
         }
-        for key in keys where key.type == "object" {
-            addSection(title: key.label, rows: key.keys.filter(\.isScalar).map { row(for: $0, path: [key.name, $0.name]) })
-        }
         for key in keys where key.type == "map" {
             addMapSection(for: key, in: frontmatter)
         }
