mutations/27-rebuild-skips-deckerrors-branch-r.patch
Test: TapTests/DeckTabTests/testTheDeckTabRefusesWhileTheFrontmatterIsBroken
diff --git i/desktop/Tap/Preview/DeckFormViewController.swift w/desktop/Tap/Preview/DeckFormViewController.swift
index 4ea877d..b42d995 100644
--- i/desktop/Tap/Preview/DeckFormViewController.swift
+++ w/desktop/Tap/Preview/DeckFormViewController.swift
@@ -193,15 +193,6 @@ final class DeckFormViewController: NSViewController, NSTextFieldDelegate {
         fields = [:]
         bindings = []
         clearMapRows()
-        guard deckErrors.isEmpty else {
-            errorLabel.stringValue = deckErrors[0]
-            for label in [errorTitleLabel, errorLabel, errorHintLabel] {
-                stack.addArrangedSubview(label)
-                label.widthAnchor.constraint(equalTo: stack.widthAnchor, constant: -40).isActive = true
-            }
-            builtForEntries = [:]
-            return
-        }
         let frontmatter = Frontmatter(text: text())
         let scalars = keys.filter(\.isScalar)
         if !scalars.isEmpty {
