mutations/27-starting-keeps-not-started-bar.patch
Test: TapTests/FocusHintTests/testNotNowWhileAnotherDeckPresentsSaysWhy
diff --git i/desktop/Tap/Windows/DeckWindowController.swift w/desktop/Tap/Windows/DeckWindowController.swift
index 8838492..387c7ec 100644
--- i/desktop/Tap/Windows/DeckWindowController.swift
+++ w/desktop/Tap/Windows/DeckWindowController.swift
@@ -85,7 +85,6 @@ final class DeckWindowController: NSWindowController, NSWindowDelegate, NSToolba
             case .starting:
                 self?.sessionController.editorViewController.hideBar(.recordingKept)
                 self?.sessionController.editorViewController.hideBar(.talkFailed)
-                self?.sessionController.editorViewController.hideBar(.talkNotStarted)
             case .presenting, .stopping: break
             }
         }
