mutations/29-handle-keeps-every-error.patch
Test: TapTests/PresentingFailureTests/testATalkEndsWhenTapPresentKeepsDying
diff --git i/desktop/Tap/Presenting/PresentationController.swift w/desktop/Tap/Presenting/PresentationController.swift
index 462c962..d2c1844 100644
--- i/desktop/Tap/Presenting/PresentationController.swift
+++ w/desktop/Tap/Presenting/PresentationController.swift
@@ -860,7 +860,7 @@ final class PresentationController {
             handleTunnel(event)
         case .error(let payload) where payload.code == "tunnel_unavailable" || payload.code == "tunnel_failed":
             handleTunnel(event)
-        case .error(let payload) where payload.meansTheCommandFailed:
+        case .error(let payload):
             lastErrorMessage = payload.message
         default:
             break
