mutations/41-autosave-elsewhere-ends-the-edit.patch
Test: TapTests/DeckTabTests/testAnAutosaveElsewhereKeepsTheFieldsFocus
diff --git i/desktop/Tap/Documents/DeckDocument.swift w/desktop/Tap/Documents/DeckDocument.swift
index 72daf36..b381475 100644
--- i/desktop/Tap/Documents/DeckDocument.swift
+++ w/desktop/Tap/Documents/DeckDocument.swift
@@ -276,7 +276,7 @@ final class DeckDocument: NSDocument {
         // in place or elsewhere (an untitled deck's), takes its text and leaves
         // the person typing; a save the person asked for, Save As or Play's
         // save ends the edit first.
-        if saveOperation == .autosaveInPlaceOperation || saveOperation == .autosaveElsewhereOperation {
+        if saveOperation == .autosaveInPlaceOperation {
             sessionController?.deckForm.commitEditingKeepingFocus()
         } else {
             _ = sessionController?.deckForm.commitEditing()
